src/cf/InformationRegisters/CardImages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>CardImages</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Image</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Card</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cards</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CardImages/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьИзображениеКарты", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзображениеКарты()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИзображениеКартыНаСервере(ТекущиеДанные.Card);	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображениеКартыНаСервере(Card)
		
	CardImagesRecordManager = InformationRegisters.CardImages.CreateRecordManager();
	CardImagesRecordManager.Card = Card;
	
	CardImagesRecordManager.Read();
	
	CardImageData = CardImagesRecordManager.Image.Get();
	CardImage = ПоместитьВоВременноеХранилище(CardImageData, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры
